Revit 2027 API
ElectricalSystem.NeutralConductorSize Property
 The size of a Neutral Conductor in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NeutralConductorSize { get; }
Public ReadOnly Property NeutralConductorSize As ElementId
	Get
public:
property ElementId^ NeutralConductorSize {
	ElementId^ get ();
}
member NeutralConductorSize : ElementId with get
Property Value
ElementId
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 Each Neutral Conductor has the same size in the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace